AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
void ICACHE_RAM_ATTR HandlePrepareForTLM() // ELRS移植，注释源码另起修改
{
  // If TLM enabled and next packet is going to be telemetry, start listening to have a large receive window (time-wise)
  if (ExpressLRS_currTlmDenom != 1 && ((OtaNonce + 1) % ExpressLRS_currTlmDenom) == 0)
  {
    Radio.RXnb();
    TelemetryRcvPhase = ttrpPreReceiveGap;
  }
}

void ICACHE_RAM_ATTR SendRCdataToRF() // ELRS移植，注释源码另起修改
{
  // // Do not send a stale channels packet to the RX if one has not been received from the handset
  // // *Do* send data if a packet has never been received from handset and the timer is running
  // // this is the case when bench testing and TXing without a handset
  // bool dontSendChannelData = false;
  // uint32_t lastRcData = handset->GetRCdataLastRecv();
  // if (lastRcData && (micros() - lastRcData > 1000000))
  // {
  //   // The tx is in Mavlink mode and without a valid crsf or RC input.  Do not send stale or fake zero packet RC!
  //   // Only send sync and MSP packets.
  //   if (config.GetLinkMode() == TX_MAVLINK_MODE)
  //   {
  //     dontSendChannelData = true;
  //   }
  //   else
  //   {
  //     return;
  //   }
  // }

  // busyTransmitting = true;

  // uint32_t const now = millis();
  // ESP requires word aligned buffer
  WORD_ALIGNED_ATTR OTA_Packet_s otaPkt = {0};
//   static uint8_t syncSlot;
//
//   const bool isTlmDisarmed = config.GetTlm() == TLM_RATIO_DISARMED;
//   uint32_t SyncInterval = (connectionState == connected && !isTlmDisarmed) ? ExpressLRS_currAirRate_RFperfParams->SyncPktIntervalConnected : ExpressLRS_currAirRate_RFperfParams->SyncPktIntervalDisconnected;
//   bool skipSync = InBindingMode ||
//     // TLM_RATIO_DISARMED keeps sending sync packets even when armed until the RX stops sending telemetry and the TLM=Off has taken effect
//     (isTlmDisarmed && handset->IsArmed() && (ExpressLRS_currTlmDenom == 1));
//
  uint8_t NonceFHSSresult = OtaNonce % ExpressLRS_currAirRate_Modparams->FHSShopInterval;

  // Sync spam only happens on slot 1 and 2 and can't be disabled
  if (!InBindingMode && FHSSonSyncChannel())
  // if ((syncSpamCounter || (syncSpamCounterAfterRateChange && FHSSonSyncChannel())) && (NonceFHSSresult == 1 || NonceFHSSresult == 2))
  {
    otaPkt.std.type = PACKET_TYPE_SYNC;
    GenerateSyncPacketData(OtaIsFullRes ? &otaPkt.full.sync.sync : &otaPkt.std.sync);
    // syncSlot = 0; // reset the sync slot in case the new rate (after the syncspam) has a lower FHSShopInterval
  }
  // // Regular sync rotates through 4x slots, twice on each slot, and telemetry pushes it to the next slot up
  // // But only on the sync FHSS channel and with a timed delay between them
  // else if ((!skipSync) && ((syncSlot / 2) <= NonceFHSSresult) && (now - SyncPacketLastSent > SyncInterval) && FHSSonSyncChannel())
  // {
  //   otaPkt.std.type = PACKET_TYPE_SYNC;
  //   GenerateSyncPacketData(OtaIsFullRes ? &otaPkt.full.sync.sync : &otaPkt.std.sync);
  //   syncSlot = (syncSlot + 1) % (ExpressLRS_currAirRate_Modparams->FHSShopInterval * 2);
  // }
  else
  {
    if (MspSender.IsActive())
    // if ((NextPacketIsMspData && MspSender.IsActive()) || dontSendChannelData)
    {
      otaPkt.std.type = PACKET_TYPE_MSPDATA;
      if (OtaIsFullRes)
      {
        otaPkt.full.msp_ul.packageIndex = MspSender.GetCurrentPayload(
          otaPkt.full.msp_ul.payload,
          sizeof(otaPkt.full.msp_ul.payload));
        // if (config.GetLinkMode() == TX_MAVLINK_MODE)
          otaPkt.full.msp_ul.tlmFlag = TelemetryReceiver.GetCurrentConfirm();
      }
      else
      {
        otaPkt.std.msp_ul.packageIndex = MspSender.GetCurrentPayload(
          otaPkt.std.msp_ul.payload,
          sizeof(otaPkt.std.msp_ul.payload));
        // if (config.GetLinkMode() == TX_MAVLINK_MODE)
        //   otaPkt.std.msp_ul.tlmFlag = TelemetryReceiver.GetCurrentConfirm();
      }

      // // send channel data next so the channel messages also get sent during msp transmissions
      // NextPacketIsMspData = false;
      // counter can be increased even for normal msp messages since it's reset if a real bind message should be sent
      BindingSendCount++;
      // // If the telemetry ratio isn't already 1:2, send a sync packet to boost it
      // // to add bandwidth for the reply
      // if (ExpressLRS_currTlmDenom != 2)
      //   syncSpamCounter = 1;
    }
    else
    {
      // // always enable msp after a channel package since the slot is only used if MspSender has data to send
      // NextPacketIsMspData = true;
      otaPkt.std.type = PACKET_TYPE_MSPDATA;
      otaPkt.full.msp_ul.tlmFlag = TelemetryReceiver.GetCurrentConfirm();
      // injectBackpackPanTiltRollData(now);
      // OtaPackChannelData(&otaPkt, ChannelData, TelemetryReceiver.GetCurrentConfirm(), ExpressLRS_currTlmDenom);
    }
  }

  ///// Next, Calculate the CRC and put it into the buffer /////
  OtaGeneratePacketCrc(&otaPkt);

  if(OtaIsFullRes)
    CRCvalue = otaPkt.full.crc;
  else 
    CRCvalue = otaPkt.std.crcLow | otaPkt.std.crcHigh;
    
  SX12XX_Radio_Number_t transmittingRadio = Radio.GetLastSuccessfulPacketRadio();

  // if (isDualRadio())
  // {
  //   switch (config.GetAntennaMode())
  //   {
  //   case TX_RADIO_MODE_GEMINI:
  //     transmittingRadio = SX12XX_Radio_All; // Gemini mode
  //     break;
  //   case TX_RADIO_MODE_ANT_1:
  //     transmittingRadio = SX12XX_Radio_1; // Single antenna tx and true diversity rx for tlm receiption.
  //     break;
  //   case TX_RADIO_MODE_ANT_2:
  //     transmittingRadio = SX12XX_Radio_2; // Single antenna tx and true diversity rx for tlm receiption.
  //     break;
  //   case TX_RADIO_MODE_SWITCH:
  //     if(OtaNonce%2==0)   transmittingRadio = SX12XX_Radio_1; // Single antenna tx and true diversity rx for tlm receiption.
  //     else   transmittingRadio = SX12XX_Radio_2; // Single antenna tx and true diversity rx for tlm receiption.
  //     break;
  //   default:
  //     break;
  //   }
  // }

#if defined(Regulatory_Domain_EU_CE_2400)
  transmittingRadio &= ChannelIsClear(transmittingRadio);   // weed out the radio(s) if channel in use

  if (transmittingRadio == SX12XX_Radio_NONE)
  {
    // No packet will be sent due to LBT.
    // Defer TXdoneCallback() to prepare for TLM when the IRQ is normally triggered.
    deferExecutionMicros(ExpressLRS_currAirRate_RFperfParams->TOA, Radio.TXdoneCallback);
  }
  else
#endif
  {
    Radio.TXnb((uint8_t*)&otaPkt, ExpressLRS_currAirRate_Modparams->PayloadLength, transmittingRadio);
  }
}

static void HandleUARTin()
{
  if(Serial.available())
  { 
    auto size = std::min(apInputBuffer.free(), (uint16_t)Serial.available());
    if (size > 0)
    {
      uint8_t buf[size];
      Serial.readBytes(buf, size);
      apInputBuffer.lock();
      apInputBuffer.pushBytes(buf, size);
      apInputBuffer.unlock();
    }
  }
}

static void HandleUARTout()
{
    if(Serial.availableForWrite())
    {
        auto size = apOutputBuffer.size();
        if (size)
        {
            uint8_t buf[size];
            apOutputBuffer.lock();
            apOutputBuffer.popBytes(buf, size);
            apOutputBuffer.unlock();
            Serial.write(buf, size);
        }
    }
}

