AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
void ICACHE_RAM_ATTR HWtimerCallbackTock() // ELRS移植，注释源码另起修改
{
  // /* If we are busy writing to EEPROM (committing config changes) then we just advance the nonces, i.e. no SPI traffic */
  // if (commitInProgress)
  // {
  //   nonceAdvance();
  //   return;
  // }

  // Radio.isFirstRxIrq = true;

  // // Sync OpenTX to this point
  // if (!(OtaNonce % ExpressLRS_currAirRate_Modparams->numOfSends))
  // {
  //   handset->JustSentRFpacket();
  // }

  // // Do not transmit or advance FHSS/Nonce until in disconnected/connected state
  // if (connectionState == awaitingModelId)
  //   return;

  // // Tx Antenna Diversity
  // if ((OtaNonce % ExpressLRS_currAirRate_Modparams->numOfSends == 0 || // Swicth with new packet data
  //     OtaNonce % ExpressLRS_currAirRate_Modparams->numOfSends == ExpressLRS_currAirRate_Modparams->numOfSends / 2) && // Swicth in the middle of DVDA sends
  //     TelemetryRcvPhase == ttrpTransmitting) // Only switch when transmitting.  A diversity rx will send tlm back on the best antenna.  So dont switch away from it.
  // {
  //   switchDiversityAntennas();
  // }

  // Nonce advances on every timer tick
  if (!InBindingMode)
    OtaNonce++;

  // If HandleTLM has started Receive mode, TLM packet reception should begin shortly
  // Skip transmitting on this slot
  if (TelemetryRcvPhase == ttrpPreReceiveGap)
  {
    TelemetryRcvPhase = ttrpExpectingTelem;
#if defined(Regulatory_Domain_EU_CE_2400)
    // Use downlink LQ for LBT success ratio instead for EU/CE reg domain
    CRSF::LinkStatistics.downlink_Link_quality = LBTSuccessCalc.getLQ();
#else
    // CRSF::LinkStatistics.downlink_Link_quality = LQCalc.getLQ();
#endif
    // LQCalc.inc();
    return;
  }
  // else if (TelemetryRcvPhase == ttrpExpectingTelem && !LQCalc.currentIsSet())
  // {
  //   // // Indicate no telemetry packet received to the DP system
  //   // DynamicPower_TelemetryUpdate(DYNPOWER_UPDATE_MISSED);
  // }

  TelemetryRcvPhase = ttrpTransmitting;

  SendRCdataToRF();
}

bool ICACHE_RAM_ATTR RXdoneISR(SX12xxDriverCommon::rx_status const status) // ELRS移植，注释源码另起修改
{
  fullRcount++;
  // if (LQCalc.currentIsSet())
  // {
  //   return false; // Already received tlm, do not run ProcessTLMpacket() again.
  // }
  bool packetSuccessful = ProcessTLMpacket(status);
#if defined(Regulatory_Domain_EU_CE_2400)
  if (packetSuccessful)
  {
    SetClearChannelAssessmentTime();
  }
#endif
  // busyTransmitting = false;
  return packetSuccessful;
}

void ICACHE_RAM_ATTR TXdoneISR() // ELRS移植，注释源码另起修改
{
//   if (!busyTransmitting)
//   {
//     return; // Already finished transmission and do not call HandleFHSS() a second time, which may hop the frequency!
//   }
  fullScount++;
  if (connectionState != awaitingModelId)
  {
    HandleFHSS();
    HandlePrepareForTLM();
#if defined(Regulatory_Domain_EU_CE_2400)
    if (TelemetryRcvPhase != ttrpPreReceiveGap)
    {
      // Start RX for Listen Before Talk early because it takes about 100us
      // from RX enable to valid instant RSSI values are returned.
      // If rx was already started by TLM prepare above, this call will let RX
      // continue as normal.
      SetClearChannelAssessmentTime();
    }
#endif // non-CE
  }
//   busyTransmitting = false;
}

void SendUIDOverMSP() // ELRS移植，注释源码另起修改
{
  MSPDataPackage[0] = MSP_ELRS_BIND;
  memcpy(&MSPDataPackage[1], &UID[2], 4);
  BindingSendCount = 0;
  MspSender.ResetState();
  MspSender.SetDataToTransmit(MSPDataPackage, 5);
}

static void EnterBindingMode() // ELRS移植，注释源码另起修改
{
    if (InBindingMode)
        return;

    // Disable the TX timer and wait for any TX to complete
    hwTimer::stop();
    // while (busyTransmitting);

    // Queue up sending the Master UID as MSP packets
    SendUIDOverMSP();

    // Binding uses a CRCInit=0, 50Hz, and InvertIQ
    OtaCrcInitializer = 0;
    OtaNonce = 0; // Lock the OtaNonce to prevent syncspam packets
    InBindingMode = true; // Set binding mode before SetRFLinkRate() for correct IQ

    // Start attempting to bind
    // Lock the RF rate and freq while binding
    SetRFLinkRate(enumRatetoIndex(RATE_BINDING));

    // Start transmitting again
    hwTimer::resume();
    Serial.println("Entered binding mode at freq = " + String(Radio.currFreq));
//   DBGLN("Entered binding mode at freq = %d", Radio.currFreq);
}

static void ExitBindingMode() // ELRS移植，注释源码另起修改
{
  if (!InBindingMode)
    return;

  MspSender.ResetState();

  // Reset CRCInit to UID-defined value
  OtaUpdateCrcInitFromUid();
  InBindingMode = false; // Clear binding mode before SetRFLinkRate() for correct IQ

  //return to original rate
  SetRFLinkRate(enumRatetoIndex(AIRRATE));
  // SetRFLinkRate(config.GetRate()); 
  Serial.println("Exiting binding mode");
  // DBGLN("Exiting binding mode");
}

static void setupBindingFromConfig() // ELRS移植，注释源码另起修改
{
  // if (firmwareOptions.hasUID)
  // {
  //     memcpy(UID, firmwareOptions.uid, UID_LEN);
  // }
  // else
  {
#ifdef PLATFORM_ESP32
    esp_read_mac(UID, ESP_MAC_WIFI_STA);
#elif PLATFORM_STM32
    UID[0] = (uint8_t)HAL_GetUIDw0();
    UID[1] = (uint8_t)(HAL_GetUIDw0() >> 8);
    UID[2] = (uint8_t)HAL_GetUIDw1();
    UID[3] = (uint8_t)(HAL_GetUIDw1() >> 8);
    UID[4] = (uint8_t)HAL_GetUIDw2();
    UID[5] = (uint8_t)(HAL_GetUIDw2() >> 8);
#endif
  }

    Serial.print("UID ");
    for (int i = 0; i < sizeof(UID); i++)
      Serial.print(String(UID[i]) + " ");
    Serial.println();
  // DBGLN("UID=(%d, %d, %d, %d, %d, %d)",
  //   UID[0], UID[1], UID[2], UID[3], UID[4], UID[5]);

  OtaUpdateCrcInitFromUid();
}

/* User Function */

void displayDebugInfo()
{
    display.clearDisplay();
    if (InBindingMode)
    {
        display.setCursor(0, 0);
        display.println("sending UID...");
    }
    else
    {
        // UID
        display.setCursor(0, 0);
        display.println("ID");
        display.setCursor(18, 0);
        display.println(UID[2]);
        display.setCursor(42, 0);
        display.println(UID[3]);
        display.setCursor(66, 0);
        display.println(UID[4]);
        display.setCursor(90, 0);
        display.println(UID[5]);
        // send freq
        display.setCursor(0, 16);
        display.println("Send");
        display.setCursor(30, 16);
        display.println(validSendFreq);
        // full Send freq
        display.setCursor(54, 16);
        display.println("FullS");
        display.setCursor(92, 16);
        display.println(fullSfreq); 
        // receive freq
        display.setCursor(0, 24);
        display.println("Recv");
        display.setCursor(30, 24);
        display.println(validReceiveFreq);  
        // full Recv freq
        display.setCursor(54, 24);
        display.println("FullR");
        display.setCursor(92, 24);
        display.println(fullRfreq);
    }
    // Freq
    display.setCursor(0, 8);
    display.println("FQ");
    display.setCursor(18, 8);
    display.println(Radio.currFreq);
    // Channel
    display.setCursor(76, 8);
    display.println("CH");
    display.setCursor(94, 8);
    display.println(FHSSgetCurrIndex());
    display.display();
}

