AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
void handleButtonPress(void)
{
    delay(25);
    if (digitalRead(PB1) == 0)
    {
        while (digitalRead(PB1) == 0)
            ;
        delay(25);
        EnterBindingMode();
    }
}

void TimerHandler()
{
    static uint16_t timercount = 0;
    if(timercount % (1000000 / TIMER_INTERVAL_MS) == 0)
    {
        validSendFreq = validSendCount;
        validSendCount = 0;
        validReceiveFreq = validReceiveCount;
        validReceiveCount = 0;
        fullSfreq = fullScount;
        fullScount = 0;
        fullRfreq = fullRcount;
        fullRcount = 0;
    }
    if(fullRfreq < 130)
    {
        digitalToggle(PC13);
    }
    timercount++;
}

void setupBasicHardWare(void)
{
    // UART
    Serial.begin(BUADRATE);
    // LED
    pinMode(PC13, OUTPUT);
    digitalWrite(PC13, HIGH);
    // Button
    pinMode(PB1, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PB1), handleButtonPress, FALLING);
    // OLED
    Wire.setSCL(PB8);
    Wire.setSDA(PB9);
    Wire.begin();
    display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.clearDisplay();
    display.display();
    // sx1280 GPIO
    pinMode(GPIO_PIN_TX_EN, OUTPUT);
    pinMode(GPIO_PIN_RX_EN, OUTPUT);
    // TIM2
    ITimer.attachInterruptInterval(TIMER_INTERVAL_MS, TimerHandler);
}

/* setup and loop */

void setup() // 保留Stubborn模块注释
{
    setupBasicHardWare();

    setupBindingFromConfig();
    FHSSrandomiseFHSSsequence(uidMacSeedGet());

    Radio.TXdoneCallback = &TXdoneISR;
    Radio.RXdoneCallback = &RXdoneISR;

    Radio.currFreq = FHSSgetInitialFreq();

    Radio.Begin(FHSSgetMinimumFreq(), FHSSgetMaximumFreq());

    TelemetryReceiver.SetDataToReceive(StubbornReceiverBuffer, sizeof(StubbornReceiverBuffer));
    // TelemetryReceiver.SetDataToReceive(CRSFinBuffer, sizeof(CRSFinBuffer));

    SetRFLinkRate(enumRatetoIndex(AIRRATE));

    hwTimer::init(nullptr, HWtimerCallbackTock);
    hwTimer::resume();

    ExpressLRS_currTlmDenom = 2;
}

void loop()
{
  // uint32_t now = millis();

  HandleUARTout();

  HandleUARTin();

  if(fullRfreq > 130)
  {
    digitalWrite(PC13, LOW);
  }
  // // only send msp data when binding is not active
  // static bool mspTransferActive = false;

  if (TelemetryReceiver.HasFinishedData())
  {
      apOutputBuffer.lock();
      apOutputBuffer.atomicPushBytes(StubbornReceiverBuffer, 140);
      apOutputBuffer.unlock();
      TelemetryReceiver.Unlock();
  }
  if (InBindingMode)
  {
    // exit bind mode if package after some repeats
    if (BindingSendCount > BindingSpamAmount) 
    {
      ExitBindingMode();
    }
  }
  else if (!MspSender.IsActive())
  {
    auto size = apInputBuffer.size();
    if (size >= 140)
    {
      apInputBuffer.lock();
      apInputBuffer.popBytes(StubbornSenderBuffer, 140);
      apInputBuffer.unlock();
      MspSender.SetDataToTransmit(StubbornSenderBuffer, 140);
    }
    // // sending is done and we need to update our flag
    // if (mspTransferActive)
    // {
    //   // unlock buffer for msp messages
    //   CRSF::UnlockMspMessage();
    //   mspTransferActive = false;
    // }
    // // we are not sending so look for next msp package
    // else
    // {
    //   uint8_t* mspData;
    //   uint8_t mspLen;
    //   CRSF::GetMspMessage(&mspData, &mspLen);
    //   // if we have a new msp package start sending
    //   if (mspData != nullptr)
    //   {
    //     MspSender.SetDataToTransmit(mspData, mspLen);
    //     mspTransferActive = true;
    //   }
    // }
  }
}
